<template>
	<view class="my-information-container">

		<!-- list -->
		<view class="panel-list">
			<view class="panel">	
				<view class="info-text">
					<rich-text :nodes="strings"></rich-text>

				 </view>
			</view>


		</view>

	</view>
</template>

<script>
	export default{
	data() {
		return {
			strings: '<br><p><strong>引言</strong></p><p><strong>欢迎您使用【逆海淘】！我们非常重视用户的隐私和个人信息保护，我们希望通过《【逆海淘】基本功能隐私政策》（“本隐私政策”）向您说明在您使用我们的产品与/或服务时我们如何收集、使用、保存、共享和转移这些信息，以及我们为您提供的访问、更新、删除和保护这些信息的方式。</strong></p>'+
			'<p><strong>一、 如何收集与使用您的个人信息</strong></p><p>- 当您登录后点击【个人信息】-> 【完善个人信息】服务时，您需要向我们提供手机号码及家庭地址，您可以修改和补充您的用户名，这些信息均属于您的个人信息”。若您不提供这类信息，我们无法为您完成送货等服务。</p><p>- 为了向您提供订单及其状态的展示服务，我们会收集您的订单信息。</p>'+
			'<p>- 为了向您提供订单及其状态的展示服务，我们会收集您的订单信息，当您选择对商品/服务进行结算时，【逆海淘】会生成您购买商品的订单。该订单中会载明订单号、您所购买的商品或服务信息、下单时间、您应支付的货款金额及支付方式。</p>'+
			'<p>- 我们的电话客服和售后功能会使用您的账号信息和订单信息。为保证您的账号安全，我们的呼叫中心客服和在线客服会使用您的账号信息与您核验您的身份。当您需要我们提供与您订单信息相关的客服与售后服务时，我们将会查询您的订单信息。另外，您在申请退款或退货时，我们需要收集您的联系人、联系方式以及退货地址，以保障完成相应的售后服务。</p>'+
			'<p>- 在您下单后，您可以选择微信支付及其他支付通道所提供的支付服务。我们需要将您的【逆海淘】订单号与交易金额信息与这些支付机构共享以完成下单支付功能。在您使用支付功能时，支付机构会通过其页面收集或验证您的银行卡（含储蓄卡、信用卡）及其他支付必要信息，以实现其确认您的支付指令并完成支付，具体适用各支付机构相应的隐私政策。</p>'+
			'<p><strong>二、我们如何使用Cookies和同类技术</strong></p><p>- 在您使用我们的服务过程中，我们会在您的移动设备上发送一个或多个名为Cookies的小数据文件，目的是为了简化您重复登录的步骤、存储您购物车中的商品数据进而帮助判断您的登录状态以及账号或数据安全。</p>'+
            '<p><strong>三、我们如何对外提供您的个人信息</strong></p><p>- 我们不会与【逆海淘】以外的任何公司、组织和个人共享您的个人信息。</p>'+
			 '<p>- 为向您提供相关产品或服务，向您展示可能感兴趣的内容，保护您的账号与交易安全，我们可能会将您的个人信息与我们的关联方或者合作伙伴共享，共享内容及目的详见此处。</p>'+
			 '<p>- 请您注意，您在使用我们服务时自愿共享甚至公开分享的信息，可能会涉及您或第三方的个人信息甚至敏感个人信息，请您共享时谨慎考虑并决定。如涉及第三方个人信息，请您确保您已经取得合法的授权。</p>'+
			'<p><strong>四、我们如何保护和保存您的个人信息</strong></p><p>- 我们会采用符合业界标准的安全防护措施，包括建立合理的制度规范、安全技术来防止您的个人信息遭到未经授权的访问使用、修改，避免数据的损坏或丢失。例如：【逆海淘】的网络服务采取了传输层安全协议加密技术，通过https方式提供浏览服务，确保用户数据在传输过程中的安全；在个人信息处理时，我们会采用包括内容替换、SHA256在内多种数据脱敏技术增强个人信息在使用中安全性。</p>'+
			 '<p>- 我们存储您个人信息的底层云技术取得了数据中心联盟颁发的“可信云”认证三级认证、通过了公安部安全等级保护三级认证，同时还获得了ISO27000认证。我们还会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。</p>'+
			 '<p>- 一旦发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。同时，我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。</p>'+
			 '<p>- 您的个人信息将存储于中华人民共和国境内。如您使用跨境交易服务，且需要向境外传输您的个人信息完成交易的，我们会单独获取您的授权同意并要求接收方按照双方签署的数据保护协议、本隐私政策以及相关法律法规要求来处理您的个人信息。</p>'+
			 '<p>- 您的个人信息将存储于中华人民共和国境内。如您使用跨境交易服务，且需要向境外传输您的个人信息完成交易的，我们会单独获取您的授权同意并要求接收方按照双方签署的数据保护协议、本隐私政策以及相关法律法规要求来处理您的个人信息。</p>'+
			 '<p><strong>五、未成年人的个人信息保护</strong></p><p>- 【逆海淘】非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用我们的产品与/或服务前，应事先取得您监护人的同意。</p>'+
			  '<p>- 对于收集到的儿童个人信息，我们除遵守本隐私政策关于用户个人信息的约定外，还会秉持正当必要、知情同意、目的明确、安全保障、依法利用的原则，严格遵循《儿童个人信息网络保护规定》等法律法规的要求进行存储、使用、披露，且不会超过实现收集、使用目的所必须的期限，到期后我们会对儿童个人信息进行删除或匿名化处理。</p>'+
			  '<p>- 一旦发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。同时，我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。</p>'+
			  '<p>- 当您作为监护人为被监护的儿童选择使用【逆海淘】相关服务时，我们可能需要向您收集被监护的儿童个人信息，用于向您履行相关服务之必要。您在使用晒单、评价及问答功能分享商品相关信息时可能会主动向我们提供儿童个人信息，请您明确知悉并谨慎选择。</p>'+
			  '<p>- 儿童或其监护人有权随时访问和更正儿童个人信息，还可以向我们提出更正和删除的请求。如您对儿童个人信息相关事宜有任何意见、建议或投诉、举报，请联系我们。我们会随时为您提供帮助。</p>'+
			  '<p><strong>六、通知和修订</strong></p><p>- 【逆海淘】为给您提供更好的服务以及随着【逆海淘】业务的发展，本隐私政策也会随之更新。但未经您明确同意，我们不会削减您依据本隐私政策所应享有的权利。我们会通过在【逆海淘】网站、【逆海淘】移动端上发出更新版本并在生效前通过网站公告或以其他适当方式提醒您相关内容的更新，也请您访问【逆海淘】以便及时了解最新的隐私政策。</p>'+
			   '<p>- 对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于邮件、短信或在浏览页面做特别提示等方式，说明隐私政策的具体变更内容）。</p>'+
			   '<p>- 我们还会将本隐私政策的旧版本存档，点击文末链接即可查阅。</p>'+
			   '<p><strong>七、如何联系我们</strong></p><p><strong>如您对本隐私政策或您个人信息的相关事宜或者投诉、举报、有任何问题、意见或建议，请通过以下方式与我们联系。</strong></p>'+
			    '<p>- 微信号：nihaitao_bi。</p>'+
				'<p><strong>八、其它说明</strong></p><p>- 为了分辨用户，开发者将在获取你的明示同意后，收集你的微信昵称、头像。</p>'+
				'<p>- 为了显示距离，开发者将在获取你的明示同意后，收集你的位置信息。</p>'+
				'<p>- 开发者收集你的地址，用于获取位置信息。</p>'+
				'<p>- 开发者收集你的发票信息，用于维护消费功能。</p>'+
				'<p>- 开发者收集你选中的照片或视频信息，用于提前上传减少上传时间。</p><p>- 为了上传图片或者视频，开发者将在获取你的明示同意后，访问你的摄像头。</p><p>- 为了登录或者注册，开发者将在获取你的明示同意后，收集你的手机号。</p><p>- 开发者使用你的通讯录（仅写入）权限，用于方便用户联系信息。</p>'+
				'<p>- 开发者收集你的设备信息，用于保障你正常使用网络服务。</p><p>- 开发者收集你的身份证号码，用于实名认证后才能继续使用的相关网络服务。</p><p>- 开发者收集你的订单信息，用于方便获取订单信息。</p><p>- 开发者收集你的发布内容，用于用户互动。</p>'+
				'<p>- 开发者收集你的所关注账号，用于用户互动。</p><p>- 开发者收集你的操作日志，用于运营维护。</p><p>- 为了保存图片或者上传图片，开发者将在获取你的明示同意后，使用你的相册（仅写入）权限。</p><p>- 为了用户互动，开发者将在获取你的明示同意后，收集你的车牌号。</p>'+
				'<p>- 开发者访问你的蓝牙，用于设备连接。</p><p>- 开发者使用你的日历（仅写入）权限，用于用户日历日程提醒。</p><p>- 为开发者收集你的邮箱，用于在必要时和用户联系。。</p><p>- 开发者收集你选中的文件，用于提前上传减少上传时间。</p>'
			   
			 

		}
		}
	}

</script>


<style lang="scss">
	.badge-style{
		width: 100rpx
	}
	.badge-text{
		align-items: center;
		text-align: center;
	}
	.my-information-container {
		height: 100%;
		background-color: #f4f4f4;

		swiper {
			height: 180px;

			.swiper-item,
			image {
				width: 100%;
				height: 100%;
			}
		}

		.top-box {
			height: 160px;
			background-color: #C00000;
			display: flex;
			justify-content: center;
			align-items: center;
			flex-direction: column;

			.avatar {
				width: 90px;
				height: 90px;
				border-radius: 45px;
				border: 2px solid #FFF;
				box-shadow: 0 1px 5px black;
			}

			.nickname {
				font-size: 16px;
				color: #fff;
				font-weight: bold;
				margin-top: 10px;
			}
		}
	}

	.panel-list {
		padding: 0 10px;
		position: relative;
		top: 10rpx;

		.panel {
			background-color: white;
			border-radius: 3px;
			margin-bottom: 8px;

			.panel-title {
				line-height: 45px;
				padding-left: 10px;
				font-size: 15px;
				border-bottom: 1px solid #F4F4F4;
			}

			.panel-body {
				display: flex;
				justify-content: space-around;

				.panel-item {
					display: flex;
					flex-direction: column;
					align-items: center;
					justify-content: space-around;
					padding: 10px 0;
					font-size: 13px;

					.icon {
						width: 80rpx;
						height: 80rpx;
					}
				}
			}
		}
	}

	.panel-list-item {
		display: flex;
		justify-content: space-between;
		align-items: center;
		font-size: 15px;
		padding: 0 10px;
		line-height: 45px;
	}

	.info-text{
		display: flex;
		width: 680rpx;
		margin: 20rpx;
		font-size: 25rpx;
		line-height: 36rpx;
		color: #202020;
		}
</style>